# TBB_AttachRecords

## Description
Attach Project, Sheet, Revision and Issue Records

```pascal
PROCEDURE TBB_AttachRecords(VAR TitleBlockBorder : HANDLE);
```

```python

def vs.TBB_AttachRecords():
    return TitleBlockBorder
```

## Parameters
|Name|Type|Description|
|---|---|---|
|TitleBlockBorder|HANDLE||

## Version
Availability: from Vectorworks 2019
## Category
* Utility